tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "bufbuild/buf"
tap "delphinus/sfmono-square"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sikarugir-app/sikarugir", "https://github.com/Sikarugir-App/homebrew-sikarugir.git"
tap "stripe/stripe-cli"
tap "withgraphite/tap"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Mozilla CA bundle for Python
brew "certifi"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# Statically typed language for the Erlang VM
brew "gleam"
# Render markdown on the CLI
brew "glow"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# OpenType text shaping engine
brew "harfbuzz"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Istio configuration command-line utility
brew "istioctl"
# New file format for still image compression
brew "jpeg-xl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Image processing and image analysis library
brew "leptonica"
# Text-based web browser
brew "lynx"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Build better apps by developing and testing code directly in Kubernetes
brew "okteto"
# Development kit for the Java programming language
brew "openjdk"
# Framework for layout and rendering of i18n text
brew "pango"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@14"
# C parser in Python
brew "pycparser"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Develop and deploy code with zero configuration
brew "railway"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI program for rolling a dice sequence
brew "roll"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Smart session manager for the terminal
brew "sesh"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Linter for Terraform files
brew "tflint"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Terminal multiplexer
brew "tmux"
# tree-sitter-cli moved to mise (dot_config/mise/config.toml): this file is
# only installed on macOS, and nvim needs the CLI on Linux too.
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
cask "font-sf-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Code editor focused on stability, without AI, subscriptions, or telemetry
cask "gram"
# Utility to hide menu bar items
cask "hiddenbar"
# Customise mouse behavior
cask "linearmouse"
# Markdown editor
cask "markedit"
# Neovim Client
cask "neovide-app"
# Replacement for Docker Desktop
cask "orbstack"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Team communication and collaboration software
cask "slack"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Developer experience toolkit used to check, test, merge, and monitor code
cask "trunk-io"
# Comic reader
cask "yacreader"
go "github.com/googleapis/api-linter/cmd/api-linter"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "gotest.tools/gotestsum"
go "github.com/fullstorydev/grpcurl/cmd/grpcurl"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/kovetskiy/mark"
go "github.com/golang/mock/mockgen"
go "github.com/fatih/motion"
go "github.com/pseudomuto/protoc-gen-doc/cmd/protoc-gen-doc"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-openapiv2"
go "github.com/envoyproxy/protoc-gen-validate"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
go "golang.org/x/tools/cmd/stringer"
uv "pipdeptree"
uv "pre-commit"
